modm-ext/data.modm.io/docs/svd/header_stm32l4r5xx.svd
        <register>
          <name>JDR4</name>
          <description>ADC group injected rank 4 data register</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 4 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD2CR</name>
          <description>ADC analog watchdog 1 configuration register</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AWD2CH</name>
              <description>ADC analog watchdog 2 monitored channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD3CR</name>
          <description>ADC analog watchdog 3 Configuration Register</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AWD3CH</name>
              <description>ADC analog watchdog 3 monitored channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIFSEL</name>
          <description>ADC differential mode selection register</description>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DIFSEL</name>
              <description>ADC channel differential or single-ended mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFACT</name>
          <description>ADC calibration factors</description>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALFACT_S</name>
              <description>ADC calibration factor in single-ended mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>CALFACT_D</name>
              <description>ADC calibration factor in differential mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>ADC common configuration register</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CKMODE</name>
              <description>ADC common clock source and prescaler (prescaler only for clock source synchronous)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PRESC</name>
              <description>ADC common clock prescaler, only for clock source asynchronous</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VREFEN</name>
              <description>ADC internal path to VrefInt enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSEN</name>
              <description>ADC internal path to temperature sensor enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBATEN</name>
              <description>ADC internal path to battery voltage enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DCMI</name>
      <description>DCMI</description>
      <baseAddress>0x50050000</baseAddress>
      <interrupt>
        <name>DCMI</name>
        <description>DCMI global interrupt</description>
        <value>85</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>DCMI control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAPTURE</name>
              <description>DCMI Capture enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CM</name>
              <description>DCMI Capture mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CROP</name>
              <description>DCMI Crop feature</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JPEG</name>
              <description>DCMI JPEG format</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESS</name>
              <description>DCMI Embedded synchronization select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKPOL</name>
              <description>DCMI Pixel clock polarity</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSPOL</name>
              <description>DCMI Horizontal synchronization polarity</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSPOL</name>
              <description>DCMI Vertical synchronization polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCRC</name>
              <description>DCMI Frame capture rate control FCRC[1:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EDM</name>
              <description>DCMI Extended data mode EDM[1:0]</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>DCMI DCMI enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSM</name>
              <description>DCMI Byte Select mode BSM[1:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OEBS</name>
              <description>DCMI Odd/Even Byte Select (Byte Select Start)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSM</name>
              <description>DCMI Line Select mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OELS</name>
              <description>DCMI Odd/Even Line Select (Line Select Start)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>DCMI status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSYNC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSYNC</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FNE</name>
              <description>DCMI FIFO not empty</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RISR</name>
          <description>DCMI raw interrupt status register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRAME_RIS</name>
              <description>DCMI Capture complete raw interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR_RIS</name>
              <description>DCMI Overrun raw interrupt status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR_RIS</name>
              <description>DCMI Synchronization error raw interrupt status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSYNC_RIS</name>
              <description>DCMI VSYNC raw interrupt status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINE_RIS</name>
              <description>DCMI Line raw interrupt status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>DCMI interrupt enable register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRAME_IE</name>
              <description>DCMI Capture complete interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR_IE</name>
              <description>DCMI Overrun interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR_IE</name>
              <description>DCMI Synchronization error interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSYNC_IE</name>
              <description>DCMI VSYNC interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINE_IE</name>
              <description>DCMI Line interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER_ALT</name>
          <description>DCMI interrupt enable register</description>
          <alternateRegister>IER</alternateRegister>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_IE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MISR</name>
          <description>DCMI masked interrupt status register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRAME_MIS</name>
              <description>DCMI Capture complete masked interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR_MIS</name>
              <description>DCMI Overrun masked interrupt status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR_MIS</name>
              <description>DCMI Synchronization error masked interrupt status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSYNC_MIS</name>
              <description>DCMI VSYNC masked interrupt status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINE_MIS</name>
              <description>DCMI Line masked interrupt status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>DCMI interrupt clear register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRAME_ISC</name>
              <description>DCMI Capture complete interrupt status clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR_ISC</name>
              <description>DCMI Overrun interrupt status clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR_ISC</name>
              <description>DCMI Synchronization error interrupt status clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSYNC_ISC</name>
              <description>DCMI Vertical synch interrupt status clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINE_ISC</name>
              <description>DCMI line interrupt status clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCR</name>
          <description>DCMI embedded synchronization code register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FSC</name>
              <description>DCMI Frame start delimiter code FSC[7:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LSC</name>
              <description>DCMI Line start delimiter code LSC[7:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LEC</name>
              <description>DCMI Line end delimiter code LEC[7:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FEC</name>
              <description>DCMI Frame end delimiter code FEC[7:0]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ESUR</name>
          <description>DCMI embedded synchronization unmask register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FSU</name>
              <description>DCMI Frame start delimiter unmask FSU[7:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LSU</name>
              <description>DCMI Line start delimiter unmask LSU[7:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LEU</name>
              <description>DCMI Line end delimiter unmask LEU[7:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FEU</name>
              <description>DCMI Frame end delimiter unmask FEU[7:0]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CWSTRTR</name>
          <description>DCMI crop window start</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HOFFCNT</name>
              <description>DCMI Horizontal offset count HOFFCNT[13:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>VST</name>
              <description>DCMI Vertical start line count VST[12:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CWSIZER</name>
          <description>DCMI crop window size</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAPCNT</name>
              <description>DCMI Capture count CAPCNT[13:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>VLINE</name>
              <description>DCMI Vertical line count VLINE[13:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>DCMI data register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BYTE0</name>
              <description>DCMI Data byte 0 Byte0[7:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BYTE1</name>
              <description>DCMI Data byte 1 Byte1[7:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BYTE2</name>
              <description>DCMI Data byte 2 Byte2[7:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BYTE3</name>
              <description>DCMI Data byte 3 Byte3[7:0]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
